create_clock -name clk -period 10.0 [get_ports clk]
set_clock_uncertainty 1.0 [get_clocks clk]
set_input_delay -max 0.0 -clock clk [get_ports {rst data_in threshold_in class_a_thresh_in class_b_thresh_in timeout_period_in}]
set_output_delay -max 0.0 -clock clk [get_ports {spike_detection event_out}]
set_load 0.01 [get_ports {spike_detection event_out}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -pin Q [get_ports {rst data_in threshold_in class_a_thresh_in class_b_thresh_in timeout_period_in}]
