# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.15-s080_1 on Sat Mar 22 17:16:43 CET 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design processing_unit

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_load -pin_load 0.01 [get_ports spike_detection]
set_load -pin_load 0.01 [get_ports {event_out[1]}]
set_load -pin_load 0.01 [get_ports {event_out[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {data_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {threshold_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_a_thresh_in[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_a_thresh_in[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_a_thresh_in[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_a_thresh_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_a_thresh_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_a_thresh_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_a_thresh_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_a_thresh_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_b_thresh_in[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_b_thresh_in[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_b_thresh_in[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_b_thresh_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_b_thresh_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_b_thresh_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_b_thresh_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {class_b_thresh_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {timeout_period_in[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports spike_detection]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {event_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.0 [get_ports {event_out[0]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports rst]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[15]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[14]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[13]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[12]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[11]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[10]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[9]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[8]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[7]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[6]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[5]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[4]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[3]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[2]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[1]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {data_in[0]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[15]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[14]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[13]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[12]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[11]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[10]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[9]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[8]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[7]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[6]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[5]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[4]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[3]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[2]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[1]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {threshold_in[0]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_a_thresh_in[7]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_a_thresh_in[6]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_a_thresh_in[5]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_a_thresh_in[4]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_a_thresh_in[3]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_a_thresh_in[2]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_a_thresh_in[1]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_a_thresh_in[0]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_b_thresh_in[7]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_b_thresh_in[6]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_b_thresh_in[5]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_b_thresh_in[4]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_b_thresh_in[3]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_b_thresh_in[2]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_b_thresh_in[1]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {class_b_thresh_in[0]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[15]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[14]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[13]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[12]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[11]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[10]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[9]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[8]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[7]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[6]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[5]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[4]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[3]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[2]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[1]}]
set_driving_cell -lib_cell sky130_osu_sc_18T_ms__dff_1 -library sky130_osu_sc_18T_ms_TT_1P8_25C.ccs -pin "Q" [get_ports {timeout_period_in[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 1.0 [get_clocks clk]
set_clock_uncertainty -hold 1.0 [get_clocks clk]
